food_delivery_rails_app/app/models/address_worker.rb

  def perform(address_id)
    address = Address.find(address_id)
    uri = URI('https://maps.googleapis.com/maps/api/geocode/json?address='+address.full_street_address+'&key='+ENV["API_KEY"])
    response = Net::HTTP.get_response(uri)
    response = JSON.parse(response.body)
    address.latitude = response["results"][0]["geometry"]["location"]["lat"]
    address.longitude = response["results"][0]["geometry"]["location"]["lng"]
    address.save!
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
UPDATE "addresses" SET "latitude" = $1, "longitude" = $2 WHERE "addresses"."id" = $3  [["latitude", 37.519677], ["longitude", -121.923814], ["id", 63]]