food_delivery_rails_app/app/models/restaurant.rb

SELECT "menus".* FROM "menus" WHERE "menus"."restaurant_id" = $1  [["restaurant_id", 9]]
---
  def get_menu_of_category(category)
    self.menus.select{|m| m.meal_category == category}.first