food_delivery_rails_app/app/models/user.rb

  def get_all_restaurants
    result = []
    User.where(entity_type:"Restaurant").find_each do |user|
---
SELECT  "users".* FROM "users" WHERE "users"."entity_type" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["entity_type", "Restaurant"], ["LIMIT", 1000]]

  def get_delivering_restaurants
    result = []
    res = self.get_all_restaurants
    res.each do |user|
      distance = dist([self.address.latitude,self.address.longitude],[user.address.latitude, user.address.longitude])
      # distance = self.address.distance_from([restaurant.latitude, restaurant.longitude])
      restaurant = Restaurant.find(user.entity_id)
---
SELECT "restaurants".* FROM "restaurants"
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 LIMIT $2  [["user_id", 15], ["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]