food_delivery_rails_app/app/controllers/api/carts_controller.rb

INSERT INTO "carts" ("consumer_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["consumer_id", 15], ["restaurant_id", 13], ["created_at", "2020-05-08 08:53:54.555814"], ["updated_at", "2020-05-08 08:53:54.555814"]]
---
  def create
    if current_user.entity_type == "Consumer"
      @cart = Cart.new(consumer_id: current_user.id,restaurant_id: params[:id],order_status:0)
      if @cart.save!

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "carts" SET "order_status" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["order_status", 3], ["updated_at", "2020-05-08 09:58:58.460142"], ["id", 2]]
INSERT INTO "orders" ("cart_id", "restaurant_id", "consumer_id") VALUES ($1, $2, $3) RETURNING "id"  [["cart_id", 2], ["restaurant_id", 13], ["consumer_id", 17]]
---
  def update_cart_status
    order = {'not_ordered'=>0,'ordered'=>1,'order_accepted'=>2,'order_denied'=>3}
    if current_user.entity_type == "Consumer"
       status = params[:order_status] if params[:order_status] == "ordered"
    else
       status = params[:order_status] if params[:order_status] == "order_accepted" || params[:order_status] == "order_denied"
    end
    @cart = Cart.find(params[:cart_id])
    if status && @cart && order[status] > order[@cart.order_status]
      @cart.update!(order_status: status)
      if params[:order_status] == "order_accepted"
        @order =  Order.create(consumer_id: current_user.id, restaurant_id: params[:id],cart_id: params[:cart_id],status:0)