food_delivery_rails_app/app/controllers/api/food_items_controller.rb

INSERT INTO "food_items" ("name", "price") VALUES ($1, $2) RETURNING "id"  [["name", "roti"], ["price", 5]]
---
  def create
    @item = FoodItem.new(name: params[:name],price: params[:price],description: params[:description])
    if item.save!