food_delivery_rails_app/app/controllers/api/orders_controller.rb

  def create
    if current_user.entity_type == "Consumer"
      @order = Order.new(consumer_id: current_user.id, restaurant_id: params[:id],cart_id: params[:cart_id],status:0)
      if @order.save!
---
INSERT INTO "orders" ("cart_id", "restaurant_id", "consumer_id") VALUES ($1, $2, $3) RETURNING "id"  [["cart_id", 2], ["restaurant_id", 13], ["consumer_id", 15]]

  def update_order_status
    if current_user.entity_type == "Restaurant"
    @order = Order.find(params[:order_id])
    if @order && @order.status != "delivered"
      p @order,params[:status]
      @order.update(status: params[:status])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1 WHERE "orders"."id" = $2  [["status", 2], ["id", 5]]