food_delivery_rails_app/app/controllers/api/restaurants_controller.rb

  def update_delivery_range
   @restaurant = Restaurant.find(current_user.entity_id)
   if @restaurant
     if @restaurant.update(delivery_range: params[:delivery_range])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "restaurants" SET "delivery_range" = $1 WHERE "restaurants"."id" = $2  [["delivery_range", "10.0"], ["id", 18]]

  def get_menu
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def set_menu
    @user = current_user
    if @user.entity_type == "Restaurant" && @user.entity_id == params[:id]
       @restaurant = Restaurant.find(params[:id])
      if @restaurant
        @menu = @restaurant.get_menu_of_category(params[:meal_category])
        @menu.destroy! if @menu
        @menu = Menu.new(meal_category: params[:meal_category],restaurant_id: params[:id])
        if @menu.save!
          params[:food_items].values.each do |item|
            @new_food_item = @menu.food_items.create(name: item['0'],price: item['1'],description: item['2'])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 1]]
INSERT INTO "menus" ("restaurant_id") VALUES ($1) RETURNING "id"  [["restaurant_id", 16]]
INSERT INTO "food_items" ("name", "price") VALUES ($1, $2) RETURNING "id"  [["name", "crepe"], ["price", 10]]