food_delivery_rails_app/app/controllers/api/restaurants_controller.rb

  def set_menu
    @user = current_user
    if @user.entity_type == "Restaurant" && @user.entity_id == params[:id]
       @restaurant = Restaurant.find(params[:id])
      if @restaurant
        @menu = @restaurant.get_menu_of_category(params[:meal_category])
        @menu.destroy! if @menu
        @menu = Menu.new(meal_category: params[:meal_category],restaurant_id: params[:id])
        if @menu.save!
---
DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 1]]
INSERT INTO "menus" ("restaurant_id") VALUES ($1) RETURNING "id"  [["restaurant_id", 9]]