food_delivery_rails_app/app/controllers/api/reviews_controller.rb

INSERT INTO "reviews" ("order_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 5], ["description", "good job"], ["created_at", "2020-05-08 10:12:05.772392"], ["updated_at", "2020-05-08 10:12:05.772392"]]
---
  def create
    @review = Review.new(description: params[:description],order_id: params[:order_id])
    if current_user.entity_type == "Consumer" && @review.save!

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "description" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["description", "bad job"], ["updated_at", "2020-05-08 10:19:19.619300"], ["id", 2]]
---
  def update
    @review = Review.find(params[:review_id])
    if current_user.entity_type == "Consumer" && @review
      @review.update(description: params[:description])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
  def destroy
    @review = Review.find(params[:review_id])
    if current_user.entity_type == "Consumer" && @review
      @review.destroy