food_delivery_rails_app/app/controllers/api/users_controller.rb

  def create
   @entity = params[:entity_type] == "Restaurant" ? Restaurant.new : Consumer.new
   @entity.save!
   @user = User.new(user_params)
   @user.entity_id = @entity.id
   if @user.save!
     @address = Address.new(address_params)
     @address.user_id = @user.id
     if @address.save
---
INSERT INTO "consumers" DEFAULT VALUES RETURNING "id"
INSERT INTO "restaurants" DEFAULT VALUES RETURNING "id"
INSERT INTO "users" ("name", "email", "password_digest", "entity_type", "entity_id", "created_at", "updated_at", "contact_no") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "addresses" ("line1", "city", "state", "country", "zipcode", "user_id", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["line1", "778,Praderia Cir"], ["city", "Fremont"], ["state", "CA"], ["country", "USA"], ["zipcode", 94539], ["user_id", 15], ["latitude", 37.519677], ["longitude", -121.923814]]

 def update_contact_number
    @user = current_user
    if @user
      if @user.update(contact_no: params[:contact_no])
---
UPDATE "users" SET "contact_no" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["contact_no", 90909090], ["updated_at", "2020-05-07 07:44:32.640065"], ["id", 8]]

  def update_address
    @user = current_user
    @address = @user.address
    if @address
      if @address.update(address_params)
---
UPDATE "addresses" SET "line1" = $1 WHERE "addresses"."id" = $2  [["line1", "765,praderia mt"], ["id", 7]]