food_delivery_rails_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
 def current_user
   # if we find a jwt token in the header
   if auth_present?
     # find the user with the decoded id
     user = User.find(auth["user"])